In [54]:
import pandas as pd
from statistics import mean, stdev, variance
from math import sqrt

# Muestreo simple

### Error
El error en la escala que está midiendo

### Nivel de confianza
Nos protege de salir la muestra mal, de manera que 95 de cada 100 muestras, sean buenas

In [55]:
file = 'exportaciones_petroleras_1988-2018.xlsx'
df = pd.read_excel(file, sheet_name='tabla')
df = df[["Periodo", "Dato"]]
df = df.dropna()
df

     Periodo      Dato
0    1988/12   560.100
1    1989/01   612.900
2    1989/02   560.700
3    1989/03   679.600
4    1989/04   692.500
..       ...       ...
355  2018/07  2604.085
356  2018/08  2723.639
357  2018/09  2774.869
358  2018/10  2685.094
359  2018/11  2353.787

[360 rows x 2 columns]

In [56]:
muestreo_aleatorio = df.sample(n = 51)
muestreo_aleatorio.head()

     Periodo      Dato
10   1989/10   692.200
216  2006/12  2627.182
323  2015/11  1521.594
0    1988/12   560.100
217  2007/01  2616.795

In [57]:
promedio_muestreo = mean(muestreo_aleatorio["Dato"])
promedio_muestreo

2000.6049411764707

In [58]:
promedio_total = mean(df["Dato"])
promedio_total

1994.9943722222222

In [59]:
desviacion_standard_total = stdev(df["Dato"])
desviacion_standard_total

1368.339865888116

In [60]:
varianza_total = variance(df["Dato"])
varianza_total

1872353.9885787077

In [61]:
# Con 51 datos
varianza_muestra = (1 - (51/360))*((varianza_total/51))
varianza_muestra

31511.840003857338

In [62]:
standard_error = sqrt(varianza_muestra)
standard_error

177.51574579134476

In [63]:
intervalo_media_error = (promedio_muestreo - standard_error, promedio_muestreo + standard_error )
intervalo_media_error

(1823.089195385126, 2178.1206869678153)

In [64]:
# Contemplan el error estándar de nuestros estimadores
# Error estandar: Cuánto te estás sesgando
limites_de_confianza = (promedio_muestreo - standard_error, promedio_muestreo + standard_error )
limites_de_confianza

(1823.089195385126, 2178.1206869678153)

In [65]:
limites_de_confianza_nivel = (promedio_muestreo - (1.96 * standard_error), promedio_muestreo + (1.96 * standard_error))
limites_de_confianza_nivel

(1652.674079425435, 2348.535802927506)

# Muestreo Aleatorio Estratificado

In [67]:
df["Periodo"] = pd.to_datetime(df["Periodo"])
df

       Periodo      Dato
0   1988-12-01   560.100
1   1989-01-01   612.900
2   1989-02-01   560.700
3   1989-03-01   679.600
4   1989-04-01   692.500
..         ...       ...
355 2018-07-01  2604.085
356 2018-08-01  2723.639
357 2018-09-01  2774.869
358 2018-10-01  2685.094
359 2018-11-01  2353.787

[360 rows x 2 columns]

In [71]:
muestra_1 = (df["Periodo"] <= pd.Timestamp(1994, 11, 1))
muestra_1

0       True
1       True
2       True
3       True
4       True
       ...
355    False
356    False
357    False
358    False
359    False
Name: Periodo, Length: 360, dtype: bool

In [73]:
muestra_1 = df[muestra_1]
muestra_1

      Periodo     Dato
0  1988-12-01  560.100
1  1989-01-01  612.900
2  1989-02-01  560.700
3  1989-03-01  679.600
4  1989-04-01  692.500
..        ...      ...
67 1994-07-01  706.225
68 1994-08-01  675.660
69 1994-09-01  630.388
70 1994-10-01  685.613
71 1994-11-01  702.076

[72 rows x 2 columns]

In [85]:
muestra_2 = df["Periodo"] <= pd.Timestamp(2000, 11, 30)
muestra_2 = df[muestra_2]
muestra_2_booleanos = muestra_2["Periodo"] >= pd.Timestamp(1994, 12, 1)
muestra_2 = muestra_2[muestra_2_booleanos]
muestra_2

       Periodo      Dato
72  1994-12-01   674.875
73  1995-01-01   642.855
74  1995-02-01   681.240
75  1995-03-01   713.362
76  1995-04-01   715.572
..         ...       ...
139 2000-07-01  1265.428
140 2000-08-01  1541.605
141 2000-09-01  1497.740
142 2000-10-01  1565.812
143 2000-11-01  1240.905

[72 rows x 2 columns]

In [86]:
muestra_3 = df["Periodo"] <= pd.Timestamp(2006, 11, 30)
muestra_3 = df[muestra_3]
muestra_3_booleanos = muestra_3["Periodo"] >= pd.Timestamp(2000, 12, 1)
muestra_3 = muestra_3[muestra_3_booleanos]
muestra_3

       Periodo      Dato
144 2000-12-01  1152.569
145 2001-01-01  1292.976
146 2001-02-01  1131.413
147 2001-03-01  1196.672
148 2001-04-01  1091.623
..         ...       ...
211 2006-07-01  3344.293
212 2006-08-01  3796.806
213 2006-09-01  2986.435
214 2006-10-01  2873.927
215 2006-11-01  2892.406

[72 rows x 2 columns]

In [87]:
muestra_4 = df["Periodo"] <= pd.Timestamp(2012, 11, 30)
muestra_4 = df[muestra_4]
muestra_4_booleanos = muestra_4["Periodo"] >= pd.Timestamp(2006, 12, 1)
muestra_4 = muestra_4[muestra_4_booleanos]
muestra_4

       Periodo      Dato
216 2006-12-01  2627.182
217 2007-01-01  2616.795
218 2007-02-01  2801.280
219 2007-03-01  3161.571
220 2007-04-01  3129.579
..         ...       ...
283 2012-07-01  3787.515
284 2012-08-01  4809.888
285 2012-09-01  4573.095
286 2012-10-01  4641.024
287 2012-11-01  4315.928

[72 rows x 2 columns]

In [89]:
muestra_5 = df["Periodo"] <= pd.Timestamp(2018, 11, 30)
muestra_5 = df[muestra_5]
muestra_5_booleanos = muestra_5["Periodo"] >= pd.Timestamp(2012, 12, 1)
muestra_5 = muestra_5[muestra_5_booleanos]
muestra_5

       Periodo      Dato
288 2012-12-01  3911.398
289 2013-01-01  4549.365
290 2013-02-01  4084.912
291 2013-03-01  4157.749
292 2013-04-01  4439.145
..         ...       ...
355 2018-07-01  2604.085
356 2018-08-01  2723.639
357 2018-09-01  2774.869
358 2018-10-01  2685.094
359 2018-11-01  2353.787

[72 rows x 2 columns]

In [93]:
df.to_csv("exportaciones_petroleras_1988-2018.csv")